<template>
    <v-layout>
      <section class="participation_rules">
        <div class="cont">
          <div class="block_head">
            <div class="title">Правила онлайн-марафона «Деловые и спортивные»</div>
          </div>

            <div class="text_block">
                <div class="cols">
                    <div class="col">
                        <h2>Основные положения</h2>

                        <p>Настоящие Правила (далее - “Правила”) регулируют порядок проведения Соревнований “Онлайн-марафон «Деловые и спортивные» (далее - “Соревнования”). </p>
                        <p>Участники, прошедшие Соревнования с наилучшими результатами по итогу всех состязаний в индивидуальном зачёте в онлайн марафоне, считаются Финалистами (далее – «Финалисты»).</p>
                        <p>Участники, прошедшие Соревнования и занявшие призовые места по суммарным результатам индивидуального зачёта в онлайн и офлайн состязаниях, считаются Победителями (далее – «Победители»).</p>
                        <p>Территория проведения Соревнований: Российская Федерация.</p>
                        <p>Место проведение Соревнований - sport.dellin.ru для онлайн формы и г. Москва для офлайн.</p>

                        <h2>Цель Соревнований</h2>

                        <p>Соревнования не являются лотереей, либо иным, основанным на риске мероприятием, и Участники Соревнований не несут имущественных рисков, связанных с участием в Соревнованиях.</p>
                        <p>Плата за участие в Соревнованиях не взимается.</p>
                        <p>Участие в Соревнованиях означает полное и безусловное принятие Участником Соревнований настоящих Правил. Участник должен до выполнения действий ознакомиться с Правилами.</p>
                        <p>Принимая правила, Участник подтверждает, что Организатор получает все права на использование загружаемых Участником данных на платформу для использования в публикациях на корпоративном портале и других источниках. Участник безвозмездно передает Организатору в пользование загружаемые им персональные фото- и видеоматериалы, прочие результаты интеллектуального труда.</p>


                        <h2>1. Организатор Соревнований</h2>

                        <ol class="start1">
                            <li>1.1. Организатором Соревнований является ООО «Деловые Линии» (далее - «Организатор»).</li>
                            <li>1.2. Адрес места нахождения (юридический адрес) Организатора: 196210, г. Санкт-Петербург, ул. Стартовая, д. 8, лит. А, оф. 132.
                            </li>
                            <li>1.3. Адрес электронной почты: <a href="mailto:game@dellin.ru">game@dellin.ru</a>.</li>
                        </ol>


                        <h2>2. Сроки проведения Соревнований</h2>

                        <ol class="start2">
                            <li>2.1. Срок проведения онлайн части Соревнований на sport.dellin.ru: с 09:00 “17” августа 2022 года по 10:00 “4” сентября 2022 года (по московскому времени).</li>

                            <li>2.2. Срок проведения офлайн части Соревнований: с .“16” сентября  2022 года по  “18” сентября 2022 года (по московскому времени).</li>

                            <li>2.3. Общий срок проведения Соревнований: с 09:00 “17” августа 2022 года по 16:00 “18.” сентября 2022 года (по московскому времени).</li>

                            <li>2.4. Срок объявления Финалистов онлайн Соревнований на sport.dellin.ru: 16 ч :00 мин  “07” сентября 2022 года (по московскому времени).</li>

                            <li>2.5. Срок объявления Победителей Соревнований: 16 ч 00 мин “18.” сентября 2022 года (по московскому времени).</li>

                            <li>2.6. Изменение сроков проведения Соревнований возможно по усмотрению Организатора с информированием о таких изменениях на корпоративном портале: sport.dellin.ru.</li>
                        </ol>


                        <h2>3. Участники Соревнований</h2>

                        <ol class="start3">
                            <li>3.1. В Соревнованиях могут принять участие как работники Организатора, так и работники следующих юридических лиц:</li>

                            <li>3.1.1. ООО «Дейли Экспресс» ОГРН 1069847569659, 196210, г. Санкт-Петербург, ул. Внуковская, дом 2, Литер А</li>

                            <li>3.1.2. ООО "ДЛ-Контакт" ОГРН 1117847108939, 196210, г. Санкт-Петербург, улица Стартовая, дом 8, Литер А, помещение 801-4</li>

                            <li>3.1.3. ООО «ДЛ-Логистические решения» ОГРН 1077847589841, 196210, г. Санкт-Петербург, улица Стартовая, дом 8, Литер А, помещение 802-29</li>

                            <li>3.1.4. ООО "ДЛ-Транс" ОГРН 1047855009960, 196210, г. Санкт-Петербург, ул. Внуковская, дом 2, Литер А</li>

                            <li>3.1.5. ООО «ДЛ-Экспедирование» ОГРН 1057813031979, 196210, г. Санкт-Петербург, ул. Внуковская, дом 2, Литер А</li>

                            <li>3.1.6. ООО "ГетКарго" ОГРН 1167847137149, 196210, г. Санкт - Петербург, улица Стартовая, дом 8, литер А, помещение 702-1.3</li>

                            <li>3.1.7. а также постоянных контрагентов Организатора (и/или перечисленных в п.п.3.1.1-3.1.6 юридических лиц) по договорам оказания услуг и иным:

                                <ul>
                                    <li>-  АБ СПБ "Параграфос" ОГРН 1167800053079, 196210, г. Санкт-Петербург, улица Стартовая, дом 8, литера А, помещение 802-5</li>

                                    <li>-  ООО "Параграфос" ОГРН 1157847063747, 196210, г. Санкт-Петербург, улица Стартовая, дом 8, литера А, помещение 701-1.4</li>

                                    <li>-  ООО "ОКН" ОГРН 1147847416870, 143420, Московская область, Красногорский район, почтовое отделение Архангельское, ул. 4 км Ильинского Шоссе, строение 8, офис 514</li>

                                    <li>- ООО "ОКН Сервис" ОГРН 1185024003075, 143420, Московская область, Красногорский район, почтовое отделение Архангельское, ул. 4 км Ильинского Шоссе, строение 8, часть помещения 516
                                    </li>

                                    <li>- ООО «Ресурс-плюс», ИНН: 7719492019, ОГРН: 1197746321607, юр.адрес: 109316, ГОРОД МОСКВА, ПРОСПЕКТ ВОЛГОГРАДСКИЙ, ДОМ 43, КОРПУС 3, ЭТ 15 ПОМ ХХХ КОМ 55;</li>

                                    <li>- ООО «Омега+», ИНН 7719825116,  ОГРН: 1127747042290, юр.адрес: 105318, ГОРОД МОСКВА, УЛИЦА ИБРАГИМОВА, ДОМ 31, КОРПУС 47, ЭТ 2 ПОМ 38,39 ОФ 205.»</li>
                                </ul>
                            </li>

                            <li>3.2. Работники юридических лиц, указанных в п. 3.1. становятся Участниками Соревнований, соглашаясь с данными Правилами.</li>

                            <li>3.3. Каждый Участник имеет возможность выиграть призы от Организатора Соревнований.</li>
                        </ol>


                        <h2>4. Порядок проведения Соревнования</h2>

                        <ol class="start4">
                            <li>4.1. Офлайн часть Соревнований проходит на сайте sport.dellin.ru.</li>

                            <li>4.2. Для участия в Соревнованиях Участникам требуется пройти регистрацию на сайте sport.dellin.ru с  09:00 “17” августа  2022 года. Регистрация на сайте закрывается в 23ч 59 минут “04 ” сентября 2022 года. Регистрацию можно пройти только один раз.</li>

                            <li>4.3. Для регистрации Участникам потребуется ввести в специальных полях свои: имя, фамилию, табельный номер сотрудника (без нулей) и адрес электронной почты. Также - поставить галочку в поле согласия на обработку персональных данных. </li>

                            <li>4.4. Далее Участнику потребуется придумать пароль и ввести его дважды: в основном и контрольном полях.</li>

                            <li>4.5. Для логина на сайте от Участников требуется ввести табельный номер сотрудника и пароль.</li>

                            <li>4.6. Для восстановления пароля от Участника потребуется заполнить форму на сайте с указанием почты, введенной при регистрации.</li>

                            <li>4.7. Единовременное нахождение на Сайте sport.dellin.ru возможно только с одного устройства.</li>

                            <li>4.8. В ходе выполнения условий каждого из заданий Участникам будут начисляться установленные Баллы.</li>
                        </ol>


                        <h2>5. Задания и условия их выполнения</h2>

                        <ol class="start5">
                            <li>
                                5.1. Задания Соревнований будут публиковаться на Сайте sport.dellin.ru.<br>
                                Для удобства Участников на Сайте будет опубликован график выхода заданий с указанием даты и времени.
                            </li>

                            <li>5.2. Участники могут выполнить задание только в отведенные для этого сроки. Выполнение задания по окончании срока невозможно. Срок окончания выполнения задания отображается на странице данного задания.</li>

                            <li>5.3. Участники имеют одну попытку для загрузки фото- и видеоматериалов без возможности дальнейшей корректировки и замены.</li>

                            <li>5.4. При попытке размещения на Сайте sport.dellin.ru материалов оскорбительного и/или сексуального содержания, дискриминирующего других Участников по расовому и половому признаку, вероисповеданию, Участник блокируется, все накопленные баллы аннулируются.</li>

                            <li>5.5. При попытке взлома данных других Участников, использования данных Участников, прочих нарушений правил, установленных организатором, Участник блокируется, баллы аннулируются.</li>

                            <li>5.6. При нестабильном Интернет-соединении и невозможности в срок выполнить задание Участник обязуется известить об этом службу технической поддержки в течение 5 минут с момента возникновения неполадки посредством текстовых сообщений в мессенджерах по указанным на Сайте sport.dellin.ru номерам. При обращении важно подтвердить факт неполадки фото экрана. При своевременном обращении и предоставлении факта сбоя Соревнований Участник получит временной бонус, чтобы выполнить задание позже.</li>

                            <li>5.7. Если по техническим причинам со стороны Организатора Участникам не удалось выполнить задание, Участникам будет дано на это дополнительное время.</li>

                            <li>
                                5.8. Участник имеет возможность обратиться в службу технической поддержки путем направления текстового сообщения в мессенджерах WhatsApp и Telegramm по номеру +79895795282.<br>
                                График работы службы техподдержки:
                                <ul>
                                    <li>09 ч 00 мин по московскому времени 17 августа 2022г  - 23 ч 59 мин  по московскому времени 23 августа 2022г - круглосуточно</li>
                                    <li>00 ч 00 мин по московскому времени 24 августа 2022 - 12 ч 00 мин “07” сентября 2022 года по московскому времени  в будни с 09.00 до 19.00 по московскому времени, в выходные с 11 ч 00 мин до 17 ч 00 мин по московскому времени.</li>
                                </ul>
                                Срок ответа на обращение в службу техподдержки составляет до 12 часов.<br>
                                Если Вы не получили ответ на свой запрос по истечении этого срока, просьба направить обращение на game@dellin.ru.<br>
                                Служба технической поддержки не предоставляет контактную информацию и иные сведения об участниках и при ответе руководствуется настоящими Правилами.
                            </li>
                        </ol>


                        <h2>6. Начисление Баллов и рейтинг</h2>

                        <ol class="start6">
                            <li>
                                6.1. За выполнение условий задания Участник получает баллы:
                                <ul>
                                    <li>●  их начисляет модератор путем оценивания правильности выполнения условий задания. За невыполнение хотя бы одного условия задания баллы за попытку или ее часть не начисляются</li>
                                    <li>●  оценка производится независимыми экспертами основываясь на личном мнении, которое обжалованию не подлежит.</li>
                                </ul>
                            </li>

                            <li>6.2. Баллы начисляются в зависимости от качества выполнения задания и соблюдения условий выполнения.</li>

                            <li>6.3. В задании важно выполнить все условия, если их несколько.</li>

                            <li>6.4. Начисление баллов за выполненное задание осуществляется не позднее 7 календарных дней с момента завершения задания.</li>

                            <li>6.5. Рейтинг обновляется каждые 24 часа после закрытия каждого задания в течение 7 календарных дней. Персональный рейтинг можно отследить в личном кабинете. Общий рейтинг доступен в общей статистике.</li>
                        </ol>
                    </div>


                    <div class="col">
                        <h2>7. Порядок определения Победителей Соревнования</h2>

                        <ol class="start7">
                            <li>7.1. Организатор “7” сентября  2022 года определяет 10 (десять) финалистов среди женщин и 10 (десять) финалистов среди мужчин, которым предстоит состязание в офлайн марафоне.</li>

                            <li>7.2. Подробности о месте и времени проведения офлайн марафона будут предоставлены финалистам по адресу указанной электронной почты, а также при обращении на <a href="mailto:game@dellin.ru">game@dellin.ru</a>.</li>

                            <li>7.3. Победителями Соревнований признаются 3 (трое) лидеров среди женщин и 3 (трое) лидеров среди мужчин по количеству набранных баллов суммарно по всем заданиям Соревнований в онлайн и офлайн состязаниях. </li>
                        </ol>


                        <h2>8. Призовой фонд Соревнований</h2>

                        <ol class="start8">
                            <li>
                                8.1. Призовой фонд Соревнований формируется за счет средств Организатора и включает в себя Ценные призы:<br>
                                Женщины:
                                <ul>
                                    <li>- 1 место среди женщин - Garmin Fenix 7X solar</li>
                                    <li>- 2 место среди женщин -Garmin fenix 7s</li>
                                    <li>- 3 место среди женщин - Garmin fenix 7s</li>
                                    <li>- 4-10 места среди женщин -Garmin instinct 2s</li>
                                </ul>
                                Мужчины:
                                <ul>
                                    <li>- 1 место среди мужчин - Garmin Fenix 7X solar</li>
                                    <li>- 2 место среди мужчин -Garmin fenix 7</li>
                                    <li>- 3 место среди мужчин -Garmin fenix 7</li>
                                    <li>- 4-10 места среди мужчин - Garmin instinct 2</li>
                                </ul>
                            </li>
                            <li>8.2. Организатор оставляет за собой право заменить Ценные призы, которые получают Победители Соревнований.</li>
                            <li>8.3 Выплата денежного эквивалента Ценного приза и обмен на другие призы не производится.</li>
                            <li>8.4. Организатор вправе отказать в предоставлении Ценного приза Участнику, который в ходе Соревнований был уволен из организации-участника Соревнований(п.3).</li>
                        </ol>


                        <h2>9. Права и обязанности Участника Соревнований</h2>

                        <ol class="start9">
                            <li>9.1. Участник имеет право на получение информации о Соревнованиях в объеме и порядке, указанном в настоящих Правилах.</li>

                            <li>9.2. Участник имеет право на получение в соответствие с настоящими Правилами приза в случаях, указанных в настоящих Правилах.</li>

                            <li>9.3. Участник обязан до участия в Соревнованиях внимательно ознакомиться с текстом настоящих Правил.</li>

                            <li>9.4. Участник обязан соблюдать настоящие Правила.</li>

                            <li>9.5. Участник обязан самостоятельно нести расходы, связанные с участием в Соревнованиях (телефонные переговоры, расходы на доступ в Интернет, приобретение реквизита, спортивного инвентаря и т.д.).</li>

                            <li>
                                9.6. Участник несет ответственность за:
                                <ul>
                                    <li>- нарушение настоящих Правил;</li>
                                    <li>- предоставление нецензурных/недостоверных и/или неполных сведений в процессе участия в Соревнованиях.</li>
                                </ul>
                            </li>
                        </ol>


                        <h2>10. Права и обязанности Организатора</h2>

                        <ol class="start10">
                            <li>10.1. Организатор имеет право изменять и дополнять настоящие Правила по собственному усмотрению с публикацией этих изменений на sport.dellin.ru.</li>

                            <li>10.2 Организатор имеет право изменять и дополнять наименования и количество призов с публикацией этих изменений на корпоративном портале sport.dellin.ru.</li>

                            <li>10.3. Организатор не несет ответственности за невозможность осуществления связи с Участником, объявленным Победителем Соревнований, по причине указания таким Участником неверных или неактуальных контактных сведений, ненадлежащей работы почтовых служб, сетей и/или средств связи.
                            </li>

                            <li>10.4. Организатор не несет ответственности и обязательств, касающихся качества призов.</li>

                            <li>10.5. Организатор не возмещает любые издержки и расходы, которые могут возникнуть у участника Соревнований или третьего лица в связи с проведением настоящих Соревнования. </li>

                            <li>10.6 Расходы финалистов, приглашенных на офлайн мероприятие, связанные непосредственно с участием в офлайн мероприятии,  Организатор берет на себя, о чем сообщит дополнительно финалисту по указанным контактным данным.</li>

                            <li> 10.7. Организатор не несёт ответственность за неисполнение либо ненадлежащее исполнение обязательств вследствие сбоев в телекоммуникационных и энергетических сетях, действий вредоносных программ, а также недобросовестных действий третьих лиц, участвующих в Соревнованиях.</li>
                        </ol>


                        <h2>11. Прочие условия</h2>

                        <ol class="start11">
                            <li>
                                11.1. Принимая участие в Соревнованиях, Участник:
                                <ul>
                                    <li>- подтверждает, что он ознакомлен и согласен с настоящими Правилами;</li>
                                    <li>- согласен по просьбе Организатора принимать участие в интервьюировании, фото- и видеосъёмке;</li>
                                    <li>- свободно, своей волей и в своем интересе, дает свое согласие на использование Организатором, в том числе в целях выдачи приза Участнику, признанному Победителем, предоставленной им информации, включая его персональные данные (фамилия, имя, отчество, город проживания, номер мобильного телефона, адрес электронной почты и иные предоставленные им персональные данные, в том числе указанные в п. 4.2. настоящих Правил), сведений о призе, материалов, изготовленных в связи с участием такого Участника в Соревнованиях, без получения предварительного согласия Участника, либо уведомления Организатором, а также без выплаты такому Участнику какого-либо вознаграждения.</li>
                                </ul>
                            </li>

                            <li>11.2. Участник подтверждает понимание того, что авторские (смежные) права на полученные материалы принадлежат Организатору.</li>

                            <li>11.3 Согласие на использование персональных данных, указанных в настоящих Правилах, может быть отозвано Участником путем направления Организатору содержащего заявление о таком отзыве заказного письма с уведомлением о вручении по адресу Организатора, указанному в п. 1.2. настоящих Правил.</li>

                            <li>11.4. Решения Организатора по всем вопросам, связанным с проведением Соревнований, а также результаты проведения Соревнований, считаются окончательными и распространяются на всех Участников Соревнований..</li>
                        </ol>


                        <h2>12. Предоставление согласия на обработку персональных данных</h2>

                        <ol class="start11">
                            <li>12.1. В целях проведения Соревнований Организатору необходимы персональные данные участников. Участники Соревнований обязуются указывать точные, корректные и актуальные (достоверные) данные в объеме и количестве, указанном в настоящих Правилах.</li>

                            <li>12.2. Факт участия в Соревнованиях является свободным, конкретным, информированным и сознательным выражением согласия участника Соревнований на обработку Организатором (и иными партнерами, действующим по поручению/заданию Организатора Соревнований) его персональных данных любыми способами, необходимыми в целях проведения Соревнований, и в порядке, предусмотренном настоящими Правилами.</li>

                            <li>12.3. Под персональными данными в целях настоящих Правил понимается любая информация, относящаяся к прямо или косвенно к физическому лицу.</li>

                            <li>12.4. Под обработкой персональных данных в настоящих Правилах понимается любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу  (распространение,  предоставление,  доступ),  обезличивание, блокирование, удаление, уничтожение персональных данных участников в целях проведения Соревнований.</li>

                            <li>12.5. Под распространением персональных данных в настоящих Правилах понимаются действия, направленные на раскрытие персональных данных неопределенному кругу лиц, а именно: открытая публикация на сайте sport.dellin.ru в сети Интернет, а также в иных источниках сведений о фамилии, имени участника Соревнований, городе или ином населённом пункте проживания, а также его призе в случаях, указанных в настоящих Правилах и (или) предусмотренных действующим законодательством РФ.</li>

                            <li>12.6. Принимая участие в Соревнованиях, Участник даёт согласие Организатору на выдачу и обработку своих персональных данных, а именно на совершение действий, предусмотренных пунктом 3 ст. 3 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».</li>
                        </ol>
                    </div>
                </div>
            </div>
        </div>
      </section>
    </v-layout>
</template>

<script>
    export default {
        name: "pages_rule",
        props: {
            rules: {required:true}
        },
        data () {
            return {
            };
        },
        mounted () {},
        computed: {},
        watch: {},
        methods: {}
    }
</script>
